#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-GGbCg1Q5foz3Ta98

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.sample_s3_lambda.data.archive_file.source: Refreshing...
module.sample_api_gateway.data.archive_file.function_archive: Refreshing...
module.sample_s3_lambda.data.archive_file.source: Refresh complete after 0s [id=a8eb6da38c7e1d31adc2af363472a1d492c6220a]
module.sample_api_gateway.data.archive_file.function_archive: Refresh complete after 0s [id=e81b1c56d56b8717274760d3bfd4242173a727bf]
module.sample_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.sample_s3_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_lambda_s3]
module.sample_s3_lambda.aws_s3_object.file_upload: Refreshing state... [id=sample_s3_lambda.zip]
module.sample_dynamodb_table.aws_dynamodb_table.tf_example_table: Refreshing state... [id=tf-test-table]
module.s3_bucket.aws_s3_bucket.lambda_bucket: Refreshing state... [id=testing-submodules-resources]
module.sample_lambda.aws_lambda_function.hello-terraform: Refreshing state... [id=hello-terraform]
module.sample_s3_lambda.aws_lambda_function.lamba_s3_example: Refreshing state... [id=lambdaS3Example]
module.sample_dynamodb_table.aws_dynamodb_table.tf_example_table: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.sample_api_gateway.aws_api_gateway_deployment.api_gateway_deployment will be created
  + resource "aws_api_gateway_deployment" "api_gateway_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "test"
    }

  # module.sample_api_gateway.aws_api_gateway_integration.api_gateway_integration will be created
  + resource "aws_api_gateway_integration" "api_gateway_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sample_api_gateway.aws_api_gateway_method.api_gateway_method will be created
  + resource "aws_api_gateway_method" "api_gateway_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sample_api_gateway.aws_api_gateway_resource.api_gateway will be created
  + resource "aws_api_gateway_resource" "api_gateway" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "mydemoresource"
      + rest_api_id = (known after apply)
    }

  # module.sample_api_gateway.aws_api_gateway_rest_api.api_gateway_rest_api will be created
  + resource "aws_api_gateway_rest_api" "api_gateway_rest_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Api Gateway for Lambda"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "api_gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # module.sample_api_gateway.aws_iam_role.iam_for_lambda_apigw will be created
  + resource "aws_iam_role" "iam_for_lambda_apigw" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_lambda_apigw"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.sample_api_gateway.aws_lambda_function.lamba_apigateway_example will be created
  + resource "aws_lambda_function" "lamba_apigateway_example" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "Example of a lambda integration with api gateway"
      + function_name                  = "tf-api-gateway"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "maxfrisedeployables"
      + s3_key                         = "tf-lambda-apigw-sample.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "kEAx2ezOjpiwEpWHuuN9fML0xIfHTryy2ZVcUoQVnVs="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "EXAMPLE_SECRET" = "this_is_a_secrete"
            }
        }
    }

  # module.sample_api_gateway.aws_lambda_permission.lambda will be created
  + resource "aws_lambda_permission" "lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tf-api-gateway"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sample_api_gateway.aws_s3_object.file_upload will be created
  + resource "aws_s3_object" "file_upload" {
      + acl                    = "private"
      + bucket                 = "maxfrisedeployables"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "73640a76dcdae0f0dc5c98c7f5ac0741"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "tf-lambda-apigw-sample.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/apigatewayexamaple/src/dist/lambda.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.sample_s3_lambda.aws_lambda_function.lamba_s3_example will be updated in-place
  ~ resource "aws_lambda_function" "lamba_s3_example" {
        id                             = "lambdaS3Example"
      ~ last_modified                  = "2023-06-13T04:10:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "VUj6B7jsFV5wt2v0Yjg+dhi16Uf377eW2H6yavLwEkg=" -> "8FK6xRtAlXqoSPOU2LiMGxadnPYFgVVtKe9x68MtGzU="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sample_s3_lambda.aws_s3_object.file_upload will be updated in-place
  ~ resource "aws_s3_object" "file_upload" {
      ~ etag                   = "a800f08012c0581f74f036aed5531cc9" -> "f32f16ac00498cb4dad15d59a02a1702"
        id                     = "sample_s3_lambda.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 9 to add, 2 to change, 0 to destroy.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*